# -*- coding: utf-8 -*-
# 配置文件，存储全局参数

# 数据参数
FEATURES = ["temp", "ph", "DO", "CODMN", "NH4N", "TP", "TN", "EC"]
TARGET = "CODMN"

# 图构建参数
THRESHOLD_KM = 50

# HMM参数
HMM_STATES = 5
WINDOW_SIZE = 10

# 训练参数
HIDDEN_DIM = 64
EPOCHS = 300
LEARNING_RATE = 0.01
WEIGHT_DECAY = 1e-4
TEST_SIZE = 0.2
RANDOM_STATE = 42
SAVE_PATH = "best_model.pth"

# 站点坐标
LOCATIONS = {
    "三胜大队渡口": (31.58, 117.871),
    "东半湖湖心": (31.522, 117.62),
    "兆河入湖区": (31.4726, 117.5605),
    "入湖口渡口": (31.3715, 117.5345),
    "北闸渡口": (31.5389, 117.3333),
    "双桥河入湖口": (31.6095, 117.83),
    "忠庙": (31.5658, 117.4696),
    "新河入湖区": (31.5674, 117.3832),
    "湖滨": (31.6461, 117.4203),
    "石堆渡口": (31.5255, 117.3885),
    "西半湖湖心": (31.6527, 117.3725),
    "黄麓": (31.5778, 117.6331),
    "龟山": (31.611101, 117.806853)
}